src/modules/form/sampleInput.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<Header>
		<Action s:mustUnderstand="1">
			Create
		</Action>
		<To s:mustUnderstand="1">
			https://mclxdpbrg2n9j1y8ftm46zszshqy.soap.marketingcloudapis.com/Service.asmx
		</To>
		<fueloauth xmlns="http://exacttarget.com">
			eyJhbGciOiJIUzI1NiIsImtpZCI6IjQiLCJ2ZXIiOiIxIiwidHlwIjoiSldUIn0.eyJhY2Nlc3NfdG9rZW4iOiJZenFIYU5zd1lnMWtCNW1CZFpNYkNjOTgiLCJjbGllbnRfaWQiOiJpYW1jcG04aXJ2ZTBxaHh5YWJtZjg0NWwiLCJlaWQiOjUxNDAwNjAyNywic3RhY2tfa2V5IjoiUzExIiwicGxhdGZvcm1fdmVyc2lvbiI6MiwiY2xpZW50X3R5cGUiOiJTZXJ2ZXJUb1NlcnZlciIsInBpZCI6MzIxfQ.sYncpv1lYrlXkx1l2Zkci9yPrgW15PIUmMXGAjOtKoI.DgjF24mof_tnuo9hlzXT7GNsdSs5rzmgjjunVTsXmZrY1KMQq-5SvsKJSkNAbBdM20i4I5KIZV7OJE1OASq_TyH0icORwkB1GrdpsGX1XyEjWnnzX3YIT29FQoahBL2YyfoiTONTuxgHQwnaH7T52MQrKqawzPCr6zpUT
		</fueloauth>
	</Header>
	<Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
			<Objects xsi:type="DataExtension">
				<Client>
					<ID>
						514006027
					</ID>
				</Client>
				<CustomerKey>
					1671116448139
				</CustomerKey>
				<Name>
					1671116448139_webForm
				</Name>
				<IsSendable>
					true
				</IsSendable>
				<SendableDataExtensionField>
					<CustomerKey>
						SubscriberKey
					</CustomerKey>
					<Name>
						SubscriberKey
					</Name>
					<FieldType>
						Text
					</FieldType>
				</SendableDataExtensionField>
				<SendableSubscriberField>
					<Name>
						Subscriber Key
					</Name>
					<Value />
				</SendableSubscriberField>
				<Fields>
					<Field>
						<CustomerKey>
							First_Name
						</CustomerKey>
						<Name>
							First_Name
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Email
						</CustomerKey>
						<Name>
							Email
						</Name>
						<FieldType>
							EmailAddress
						</FieldType>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Gender
						</CustomerKey>
						<Name>
							Gender
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							6
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							City
						</CustomerKey>
						<Name>
							City
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							State
						</CustomerKey>
						<Name>
							State
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Postal
						</CustomerKey>
						<Name>
							Postal
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							5
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							TMZ
						</CustomerKey>
						<Name>
							TMZ
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Language
						</CustomerKey>
						<Name>
							Language
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Username
						</CustomerKey>
						<Name>
							Username
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Opt_in_date
						</CustomerKey>
						<Name>
							Opt_in_date
						</Name>
						<FieldType>
							Date
						</FieldType>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Channel_Preference
						</CustomerKey>
						<Name>
							Channel_Preference
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							AccountID
						</CustomerKey>
						<Name>
							AccountID
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							DMA
						</CustomerKey>
						<Name>
							DMA
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Birthday
						</CustomerKey>
						<Name>
							Birthday
						</Name>
						<FieldType>
							Date
						</FieldType>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
					<Field>
						<CustomerKey>
							Rewards_Member
						</CustomerKey>
						<Name>
							Rewards_Member
						</Name>
						<FieldType>
							Text
						</FieldType>
						<MaxLength>
							50
						</MaxLength>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
						<Name>
							App_Installed
						</Name>
						<FieldType>
							Boolean
						</FieldType>
						<IsRequired>
							false
						</IsRequired>
						<IsPrimaryKey>
							false
						</IsPrimaryKey>
					</Field>
				</Fields>
			</Objects>
		</CreateRequest>
	</Body>
</Envelope>
